Revit 2024 API
VoltageTypeSet.Clear Method
Removes every voltage type from the set, rendering it empty.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Clear()
Visual Basic
Public Overridable Sub Clear
Visual C++
public:
virtual void Clear()
See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace